Repository: Git-Rocky-Stack/Agent-X
Catalog: src/AgentX.App/Strings/*/Resources.resw
Source language: en_us
Languages: de, es, fr, ja, zh_cn

# PastSelf_DraftNoProvider
source: No AI provider is available, so no draft was written. Choose one under Settings > AI Providers and check it with Test Connection, then try again.
de: Es ist kein KI-Anbieter verfügbar, daher wurde kein Entwurf geschrieben. Wählen Sie unter Einstellungen > KI-Anbieter einen aus, prüfen Sie ihn mit „Verbindung testen“ und versuchen Sie es dann erneut.
es: No hay ningún proveedor de IA disponible, así que no se escribió ningún borrador. Elija uno en Configuración > Proveedores de IA y compruébelo con Probar conexión; después, vuelva a intentarlo.
fr: Aucun fournisseur d'IA n'est disponible, donc aucun brouillon n'a été rédigé. Choisissez-en un dans Paramètres > Fournisseurs d'IA, vérifiez-le avec Tester la connexion, puis réessayez.
ja: 利用できる AI プロバイダーがないため、下書きは作成されませんでした。設定 > AI プロバイダーでプロバイダーを選び、[接続をテスト] で確認してから、もう一度お試しください。
zh_cn: 没有可用的 AI 提供商，因此未撰写草稿。请在“设置 > AI 提供商”中选择一个提供商，用“测试连接”检查后再试。

# PastSelf_DraftFailed
source: The AI provider could not write the draft: {0}
de: Der KI-Anbieter konnte den Entwurf nicht schreiben: {0}
es: El proveedor de IA no pudo escribir el borrador: {0}
fr: Le fournisseur d'IA n'a pas pu rédiger le brouillon : {0}
ja: AI プロバイダーが下書きを作成できませんでした: {0}
zh_cn: AI 提供商无法撰写草稿：{0}

# PastSelf_DraftEmpty
source: The AI provider returned an empty draft. Try again, or describe the context in more detail.
de: Der KI-Anbieter hat einen leeren Entwurf zurückgegeben. Versuchen Sie es erneut, oder beschreiben Sie den Kontext genauer.
es: El proveedor de IA devolvió un borrador vacío. Vuelva a intentarlo o describa el contexto con más detalle.
fr: Le fournisseur d'IA a renvoyé un brouillon vide. Réessayez, ou décrivez le contexte plus en détail.
ja: AI プロバイダーから空の下書きが返されました。もう一度試すか、コンテキストをより詳しく入力してください。
zh_cn: AI 提供商返回了空草稿。请重试，或更详细地描述上下文。

# PastSelf_DraftCancelled
source: Draft cancelled. Nothing was kept.
de: Entwurf abgebrochen. Nichts davon wurde behalten.
es: Borrador cancelado. No se conservó nada.
fr: Brouillon annulé. Rien n'a été conservé.
ja: 下書きの作成をキャンセルしました。内容は保持されていません。
zh_cn: 已取消草稿，未保留任何内容。

# PastSelf_DraftBasisModel
source: Written by {0}.
de: Geschrieben von {0}.
es: Escrito por {0}.
fr: Rédigé par {0}.
ja: 作成: {0}
zh_cn: 撰写者：{0}

# PastSelf_DraftBasisVoice
source: Follows the writing style in your voice profile above.
de: Folgt dem Schreibstil aus Ihrem Stilprofil oben.
es: Sigue el estilo de escritura de su perfil de voz, que aparece arriba.
fr: Suit le style d'écriture de votre profil de voix ci-dessus.
ja: 上の文体プロファイルの書き方に沿っています。
zh_cn: 遵循上方画像中测得的写作风格。

# PastSelf_DraftBasisNoVoice
source: No writing style has been measured yet, so the draft uses a neutral voice.
de: Es wurde noch kein Schreibstil gemessen, daher klingt der Entwurf neutral.
es: Todavía no se ha medido ningún estilo de escritura, así que el borrador usa una voz neutra.
fr: Aucun style d'écriture n'a encore été mesuré, donc le brouillon adopte une voix neutre.
ja: 文体がまだ測定されていないため、下書きは中立的な文体で作成されています。
zh_cn: 尚未测得写作风格，因此草稿使用中性语气。

# PastSelf_DraftBasisViews
source: Views used, as recorded by {0}: {1}
de: Verwendete Sichtweisen, erfasst bis {0}: {1}
es: Puntos de vista usados, registrados hasta el {0}: {1}
fr: Points de vue utilisés, enregistrés jusqu'au {0} : {1}
ja: {0} までに記録された見方のうち使用したもの: {1}
zh_cn: 使用的观点（截至 {0} 的记录）：{1}

# PastSelf_DraftBasisNoViews
source: None of your views recorded by {0} relate to this draft.
de: Keine Ihrer bis {0} erfassten Sichtweisen betrifft diesen Entwurf.
es: Ninguno de sus puntos de vista registrados hasta el {0} tiene relación con este borrador.
fr: Aucun de vos points de vue enregistrés jusqu'au {0} ne concerne ce brouillon.
ja: {0} までに記録された見方に、この下書きに関係するものはありません。
zh_cn: 截至 {0} 记录的观点均与此草稿无关。

# PastSelf_DraftBasisInsights
source: Saved insights used as background: {0}
de: Als Hintergrund verwendete gespeicherte Erkenntnisse: {0}
es: Ideas guardadas usadas como contexto: {0}
fr: Idées enregistrées utilisées comme contexte : {0}
ja: 背景として使用した保存済みインサイト: {0}
zh_cn: 作为背景使用的已保存洞见：{0}

# PastSelf_NoRecords
source: No records found about "{0}" from the selected time period.
de: Keine Einträge zu „{0}“ aus dem gewählten Zeitraum gefunden.
es: No se encontraron registros sobre "{0}" del período seleccionado.
fr: Aucun enregistrement sur « {0} » pour la période sélectionnée.
ja: 選択した期間に「{0}」の記録は見つかりませんでした。
zh_cn: 在所选时间范围内未找到关于“{0}”的记录。

# PastSelf_ThoughtAbout
source: Here's what you thought about {0}.
de: So haben Sie über {0} gedacht.
es: Esto es lo que pensaba sobre {0}.
fr: Voici ce que vous pensiez de {0}.
ja: {0} についてのあなたの考えは次のとおりです。
zh_cn: 以下是您对 {0} 的看法。

# PastSelf_ThoughtAboutWhen
source: Here's what you thought about {0} {1}.
de: So haben Sie {1} über {0} gedacht.
es: Esto es lo que pensaba sobre {0} {1}.
fr: Voici ce que vous pensiez de {0} {1}.
ja: {1}の {0} についてのあなたの考えは次のとおりです。
zh_cn: 以下是您{1}对 {0} 的看法。

# PastSelf_TimeToday
source: today
de: heute
es: hoy
fr: aujourd'hui
ja: 今日
zh_cn: 今天

# PastSelf_TimeYesterday
source: yesterday
de: gestern
es: ayer
fr: hier
ja: 昨日
zh_cn: 昨天

# PastSelf_TimeDaysAgo
source: {0} days ago
de: vor {0} Tagen
es: hace {0} días
fr: il y a {0} jours
ja: {0} 日前
zh_cn: {0} 天前

# PastSelf_TimeAboutAWeekAgo
source: about a week ago
de: vor etwa einer Woche
es: hace aproximadamente una semana
fr: il y a environ une semaine
ja: 約 1 週間前
zh_cn: 大约一周前

# PastSelf_TimeWeeksAgo
source: about {0} weeks ago
de: vor etwa {0} Wochen
es: hace aproximadamente {0} semanas
fr: il y a environ {0} semaines
ja: 約 {0} 週間前
zh_cn: 大约 {0} 周前

# PastSelf_TimeAboutAMonthAgo
source: about a month ago
de: vor etwa einem Monat
es: hace aproximadamente un mes
fr: il y a environ un mois
ja: 約 1 か月前
zh_cn: 大约一个月前

# PastSelf_TimeMonthsAgo
source: about {0} months ago
de: vor etwa {0} Monaten
es: hace aproximadamente {0} meses
fr: il y a environ {0} mois
ja: 約 {0} か月前
zh_cn: 大约 {0} 个月前

# PastSelf_TimeAboutAYearAgo
source: about a year ago
de: vor etwa einem Jahr
es: hace aproximadamente un año
fr: il y a environ un an
ja: 約 1 年前
zh_cn: 大约一年前

# PastSelf_TimeYearsAgo
source: about {0} years ago
de: vor etwa {0} Jahren
es: hace aproximadamente {0} años
fr: il y a environ {0} ans
ja: 約 {0} 年前
zh_cn: 大约 {0} 年前

# PastSelf_SearchFailed
source: Could not search Past Self: {0}
de: Die Suche ist fehlgeschlagen: {0}
es: No se pudo completar la búsqueda: {0}
fr: La recherche a échoué : {0}
ja: 検索できませんでした: {0}
zh_cn: 搜索失败：{0}

# PastSelf_InsightsFound
source: Relevant insights found: {0}
de: Gefundene relevante Erkenntnisse: {0}
es: Ideas relevantes encontradas: {0}
fr: Idées pertinentes trouvées : {0}
ja: 見つかった関連インサイト: {0} 件
zh_cn: 找到的相关洞见：{0}

# PastSelf_NoInsights
source: No relevant insights found.
de: Keine relevanten Erkenntnisse gefunden.
es: No se encontraron ideas relevantes.
fr: Aucune idée pertinente trouvée.
ja: 関連するインサイトは見つかりませんでした。
zh_cn: 未找到相关洞见。

# PastSelf_InsightRelatedTo
source: Related to {0}
de: Bezieht sich auf {0}
es: Relacionada con {0}
fr: En lien avec {0}
ja: 関連: {0}
zh_cn: 相关主题：{0}

# PastSelf_InsightsFailed
source: Could not get insights: {0}
de: Die Erkenntnisse konnten nicht abgerufen werden: {0}
es: No se pudieron obtener las ideas: {0}
fr: Impossible d'obtenir les idées : {0}
ja: インサイトを取得できませんでした: {0}
zh_cn: 无法获取洞见：{0}

# PastSelf_NoEvolution
source: No belief evolution tracked for "{0}" yet.
de: Für „{0}“ wurde noch keine Entwicklung einer Überzeugung erfasst.
es: Todavía no se ha registrado ninguna evolución de creencias para "{0}".
fr: Aucune évolution de conviction n'a encore été suivie pour « {0} ».
ja: 「{0}」の考えの変遷はまだ記録されていません。
zh_cn: 尚未记录“{0}”的观点演变。

# PastSelf_BeliefEvolved
source: Your belief about {0} has evolved since {1}.
de: Ihre Überzeugung zu {0} hat sich seit {1} weiterentwickelt.
es: Su creencia sobre {0} ha evolucionado desde {1}.
fr: Votre conviction sur {0} a évolué depuis {1}.
ja: {0} についての考えは {1} 以降に変化しています。
zh_cn: 自 {1} 以来，您对 {0} 的观点已发生演变。

# PastSelf_BeliefConsistent
source: Your belief about {0} has been consistent since {1}.
de: Ihre Überzeugung zu {0} ist seit {1} unverändert.
es: Su creencia sobre {0} se ha mantenido igual desde {1}.
fr: Votre conviction sur {0} est restée la même depuis {1}.
ja: {0} についての考えは {1} 以降変わっていません。
zh_cn: 自 {1} 以来，您对 {0} 的观点一直未变。

# PastSelf_EvolutionFailed
source: Could not get belief evolution: {0}
de: Die Entwicklung der Überzeugung konnte nicht abgerufen werden: {0}
es: No se pudo obtener la evolución de la creencia: {0}
fr: Impossible d'obtenir l'évolution de la conviction : {0}
ja: 考えの変遷を取得できませんでした: {0}
zh_cn: 无法获取观点演变：{0}

# PastSelf_ActiveTopicsFound
source: Topics explored recently: {0}
de: Kürzlich behandelte Themen: {0}
es: Temas explorados recientemente: {0}
fr: Sujets explorés récemment : {0}
ja: 最近取り上げたトピック: {0} 件
zh_cn: 近期探索的主题：{0}

# PastSelf_NoActiveTopics
source: No active topics detected in the past 30 days.
de: In den letzten 30 Tagen wurden keine aktiven Themen erkannt.
es: No se detectaron temas activos en los últimos 30 días.
fr: Aucun sujet actif détecté au cours des 30 derniers jours.
ja: 過去 30 日間にアクティブなトピックは検出されませんでした。
zh_cn: 过去 30 天内未检测到活跃主题。

# PastSelf_ActiveTopicsFailed
source: Could not get active topics: {0}
de: Die aktiven Themen konnten nicht abgerufen werden: {0}
es: No se pudieron obtener los temas activos: {0}
fr: Impossible d'obtenir les sujets actifs : {0}
ja: アクティブなトピックを取得できませんでした: {0}
zh_cn: 无法获取活跃主题：{0}

# PastSelf_VoiceProfileFailed
source: Could not load the voice profile: {0}
de: Das Stilprofil konnte nicht geladen werden: {0}
es: No se pudo cargar el perfil de voz: {0}
fr: Impossible de charger le profil de voix : {0}
ja: 文体プロファイルを読み込めませんでした: {0}
zh_cn: 无法加载写作画像：{0}

# PastSelf_StyleNotEnoughData
source: Not enough data
de: Nicht genug Daten
es: No hay suficientes datos
fr: Pas assez de données
ja: データ不足
zh_cn: 数据不足

# PastSelf_StyleCasual
source: Casual
de: Locker
es: Informal
fr: Décontracté
ja: カジュアル
zh_cn: 随意

# PastSelf_StyleBalanced
source: Balanced
de: Ausgewogen
es: Equilibrado
fr: Équilibré
ja: バランス
zh_cn: 适中

# PastSelf_StyleFormal
source: Formal
de: Förmlich
fr: Soutenu
ja: フォーマル
zh_cn: 正式

# PastSelf_GuideQueryExample.Text
source: Topic: Remote work is better for focus; Time period: Past year
de: Thema: Remote work is better for focus; Zeitraum: Letztes Jahr
es: Tema: Remote work is better for focus; Período: Último año
fr: Sujet : Remote work is better for focus ; Période : Année passée
ja: トピック: Remote work is better for focus、期間: 過去 1 年
zh_cn: 主题：Remote work is better for focus；时间范围：过去一年

# Settings_ApiKey2.Text
source: API Key
de: API-Schlüssel
es: Clave de API
fr: Clé API
ja: API キー
zh_cn: API 密钥

# Settings_Endpoint3.Text
source: Endpoint
de: Endpunkt
fr: Point de terminaison
ja: エンドポイント
zh_cn: 端点

# Settings_DefaultModel2.Text
source: Default Model
de: Standardmodell
es: Modelo predeterminado
fr: Modèle par défaut
ja: 既定のモデル
zh_cn: 默认模型

# Settings_NoteAnthropicDoesNot.Text
source: Note: Anthropic does not support embeddings. Use Ollama or OpenAI for document indexing.
de: Hinweis: Anthropic unterstützt keine Embeddings. Verwenden Sie Ollama oder OpenAI für die Dokumentindexierung.
es: Nota: Anthropic no admite embeddings. Use Ollama u OpenAI para indexar documentos.
fr: Remarque : Anthropic ne prend pas en charge les embeddings. Utilisez Ollama ou OpenAI pour l'indexation des documents.
ja: 注: Anthropic は埋め込みに対応していません。ドキュメントのインデックス作成には Ollama または OpenAI をご利用ください。
zh_cn: 注意:Anthropic 不支持嵌入。请使用 Ollama 或 OpenAI 进行文档索引。

# Settings_TestConnection3.Content
source: Test Connection
de: Verbindung testen
es: Probar conexión
fr: Tester la connexion
ja: 接続をテスト
zh_cn: 测试连接

# Settings_Appearance.Text
source: Appearance
de: Darstellung
es: Apariencia
fr: Apparence
ja: 外観
zh_cn: 外观

# Settings_Theme.Text
source: Theme
de: Design
es: Tema
fr: Thème
ja: テーマ
zh_cn: 主题

# Settings_ChangesApplyImmediatelySystem.Text
source: Changes apply immediately. 'System Default' follows your Windows theme.
de: Änderungen gelten sofort. „Systemstandard“ folgt Ihrem Windows-Design.
es: Los cambios se aplican de inmediato. 'Predeterminado del sistema' sigue el tema de Windows.
fr: Les modifications s'appliquent immédiatement. « Valeur système » suit votre thème Windows.
ja: 変更は即座に適用されます。「システム既定」は Windows のテーマに従います。
zh_cn: 更改立即生效。“系统默认”跟随您的 Windows 主题。

# Settings_MultiModelRouting.Text
source: Multi-Model Routing
de: Multi-Modell-Routing
es: Enrutamiento multimodelo
fr: Routage multi-modèles
ja: マルチモデル ルーティング
zh_cn: 多模型路由

# Settings_AutomaticallyRoutePromptsTo.Text
source: Automatically route prompts to the best AI model based on task type. Extraction and chat prefer fast local models; analysis and code prefer quality cloud models.
de: Leitet Prompts je nach Aufgabentyp automatisch an das beste KI-Modell weiter. Extraktion und Chat bevorzugen schnelle lokale Modelle; Analyse und Code bevorzugen hochwertige Cloud-Modelle.
es: Dirija automáticamente los prompts al mejor modelo de IA según el tipo de tarea. La extracción y el chat prefieren modelos locales rápidos; el análisis y el código prefieren modelos de nube de calidad.
fr: Achemine automatiquement les prompts vers le meilleur modèle d'IA selon le type de tâche. L'extraction et le chat privilégient les modèles locaux rapides ; l'analyse et le code privilégient les modèles cloud de qualité.
ja: タスクの種類に応じて、プロンプトを最適な AI モデルに自動でルーティングします。抽出とチャットは高速なローカル モデル、分析とコードは高品質なクラウド モデルを優先します。
zh_cn: 根据任务类型自动将提示词路由到最合适的 AI 模型。提取和聊天优先使用快速本地模型;分析和代码优先使用高质量云端模型。

# Settings_EnableAutoRouting.Header
source: Enable Auto-Routing
de: Auto-Routing aktivieren
es: Activar enrutamiento automático
fr: Activer le routage automatique
ja: 自動ルーティングを有効化
zh_cn: 启用自动路由

# Settings_RoutingProfile.Text
source: Routing Profile
de: Routing-Profil
es: Perfil de enrutamiento
fr: Profil de routage
ja: ルーティング プロファイル
zh_cn: 路由配置

# Settings_CostOptimizedLocalModels.Text
source: Cost Optimized — Local models for all tasks, cloud only as fallback
de: Kostenoptimiert — Lokale Modelle für alle Aufgaben, Cloud nur als Fallback
es: Optimizado en costes — Modelos locales para todas las tareas, nube solo como respaldo
fr: Optimisé coût — Modèles locaux pour toutes les tâches, cloud seulement en secours
ja: コスト最適化 — すべてのタスクをローカル モデルで処理し、クラウドはフォールバックのみ
zh_cn: 成本优先 — 所有任务使用本地模型,云端仅作后备

# Settings_QualityOptimizedCloudModels.Text
source: Quality Optimized — Cloud models for analysis, code, creative
de: Qualitätsoptimiert — Cloud-Modelle für Analyse, Code und Kreatives
es: Optimizado en calidad — Modelos de nube para análisis, código y creatividad
fr: Optimisé qualité — Modèles cloud pour l'analyse, le code et la création
ja: 品質最適化 — 分析、コード、クリエイティブにクラウド モデルを使用
zh_cn: 质量优先 — 分析、代码、创意任务使用云端模型

# Settings_BalancedLocalForSimple.Text
source: Balanced — Local for simple tasks, cloud for quality-critical tasks
de: Ausgewogen — Lokal für einfache Aufgaben, Cloud für qualitätskritische Aufgaben
es: Equilibrado — Local para tareas simples, nube para tareas críticas de calidad
fr: Équilibré — Local pour les tâches simples, cloud pour les tâches critiques en qualité
ja: バランス — 単純なタスクはローカル、品質重視のタスクはクラウド
zh_cn: 均衡 — 简单任务用本地,质量关键任务用云端

# Settings_CostTracking.Text
source: Cost Tracking
de: Kostenverfolgung
es: Seguimiento de costes
fr: Suivi des coûts
ja: コスト追跡
zh_cn: 成本跟踪

# Settings_EstimatedApiCostsFor.Text
source: Estimated API costs for cloud providers. Local Ollama models are free.
de: Geschätzte API-Kosten für Cloud-Anbieter. Lokale Ollama-Modelle sind kostenlos.
es: Costes de API estimados para proveedores de nube. Los modelos locales de Ollama son gratuitos.
fr: Coûts d'API estimés pour les fournisseurs cloud. Les modèles Ollama locaux sont gratuits.
ja: クラウド プロバイダーの API コストの概算です。ローカルの Ollama モデルは無料です。
zh_cn: 云端提供商的预估 API 费用。本地 Ollama 模型免费。

# Settings_TotalSpend.Text
source: TOTAL SPEND
de: GESAMTAUSGABEN
es: GASTO TOTAL
fr: DÉPENSE TOTALE
ja: 合計支出
zh_cn: 总支出

# Settings_Today.Text
source: TODAY
de: HEUTE
es: HOY
fr: AUJOURD'HUI
ja: 今日
zh_cn: 今日

# Settings_TotalTokens.Text
source: TOTAL TOKENS
de: TOKENS GESAMT
es: TOKENS TOTALES
fr: TOKENS TOTAUX
ja: 合計トークン
zh_cn: 总 Token 数

# Settings_Inference.Text
source: Inference
de: Inferenz
es: Inferencia
fr: Inférence
ja: 推論
zh_cn: 推理

# Settings_Temperature.Text
source: Temperature
de: Temperatur
es: Temperatura
fr: Température
ja: 温度
zh_cn: 温度

# Settings_MaxTokens.Text
source: Max Tokens
es: Tokens máx.
fr: Tokens max.
ja: 最大トークン数
zh_cn: 最大 Token 数

# Settings_ContextWindow.Text
source: Context Window
de: Kontextfenster
es: Ventana de contexto
fr: Fenêtre de contexte
ja: コンテキスト ウィンドウ
zh_cn: 上下文窗口

# Settings_ChunkSizeTokens.Text
source: Chunk Size (tokens)
de: Chunk-Größe (Tokens)
es: Tamaño de fragmento (tokens)
fr: Taille des fragments (tokens)
ja: チャンク サイズ (トークン)
zh_cn: 块大小(Token)

# Settings_ChunkOverlap.Text
source: Chunk Overlap
de: Chunk-Überlappung
es: Superposición de fragmentos
fr: Chevauchement des fragments
ja: チャンクの重なり
zh_cn: 块重叠

# Settings_TopKResults.Text
source: Top-K Results
de: Top-K-Ergebnisse
es: Resultados Top-K
fr: Résultats Top-K
ja: 上位 K 件の結果
zh_cn: Top-K 结果数

# Settings_AutoIndexWatchFolders.Header
source: Auto-index watch folders
de: Überwachte Ordner automatisch indexieren
es: Indexar automáticamente carpetas vigiladas
fr: Indexer automatiquement les dossiers surveillés
ja: 監視フォルダーを自動インデックス
zh_cn: 自动索引监视文件夹

# Settings_ResearchMode.Text
source: Research Mode
de: Recherchemodus
es: Modo investigación
fr: Mode recherche
ja: リサーチ モード
zh_cn: 研究模式

# Settings_AugmentAiAnswersWith.Text
source: Augment chat answers with live web sources. When enabled and Research Mode is on in chat, your question is sent to the search provider below and the results are added to the answer with their sources.
de: Ergänzen Sie Chat-Antworten mit Live-Webquellen. Wenn aktiviert und der Recherchemodus im Chat eingeschaltet ist, wird Ihre Frage an den unten gewählten Suchanbieter gesendet, und die Ergebnisse werden mit ihren Quellen zur Antwort hinzugefügt.
es: Complemente las respuestas del chat con fuentes web en vivo. Si está activado y el modo investigación está encendido en el chat, su pregunta se envía al proveedor de búsqueda indicado abajo y los resultados se añaden a la respuesta con sus fuentes.
fr: Enrichissez les réponses du chat avec des sources web en direct. Lorsque cette option est activée et que le mode recherche est allumé dans le chat, votre question est envoyée au fournisseur de recherche ci-dessous et les résultats sont ajoutés à la réponse avec leurs sources.
ja: チャットの回答をライブの Web ソースで補強します。有効にしてチャットでリサーチ モードをオンにすると、質問が下の検索プロバイダーに送信され、結果が出典付きで回答に追加されます。
zh_cn: 用实时网络来源增强聊天回答。启用此项并在聊天中开启研究模式后，您的问题会发送到下方的搜索提供商，搜索结果会连同来源一起添加到回答中。

# Settings_EnableResearchMode.Header
source: Enable Research Mode
de: Recherchemodus aktivieren
es: Activar modo investigación
fr: Activer le mode recherche
ja: リサーチ モードを有効化
zh_cn: 启用研究模式

# Settings_EnableResearchMode.OffContent
source: No web search
de: Keine Websuche
es: Sin búsqueda web
fr: Aucune recherche web
ja: Web 検索なし
zh_cn: 不进行网络搜索

# Settings_EnableResearchMode.OnContent
source: Chat can add web results
de: Chat kann Webergebnisse hinzufügen
es: El chat puede añadir resultados web
fr: Le chat peut ajouter des résultats web
ja: チャットで Web の結果を追加できます
zh_cn: 聊天可添加网络结果

# Settings_SearchProvider.Text
source: Search Provider
de: Suchanbieter
es: Proveedor de búsqueda
fr: Fournisseur de recherche
ja: 検索プロバイダー
zh_cn: 搜索提供商

# Settings_SearchApiKey.Text
source: API Key or Instance URL
de: API-Schlüssel oder Instanz-URL
es: Clave de API o URL de la instancia
fr: Clé API ou URL de l’instance
ja: API キーまたはインスタンス URL
zh_cn: API 密钥或实例 URL

# Settings_EnterYourSearchApiPh.PlaceholderText
source: Brave or Serper API key, or SearXNG URL
de: Brave- oder Serper-API-Schlüssel oder SearXNG-URL
es: Clave de API de Brave o Serper, o URL de SearXNG
fr: Clé API Brave ou Serper, ou URL SearXNG
ja: Brave または Serper の API キー、または SearXNG の URL
zh_cn: Brave 或 Serper API 密钥，或 SearXNG URL

# Settings_MaxSearchResults.Text
source: Max Search Results
de: Max. Suchergebnisse
es: Resultados de búsqueda máx.
fr: Résultats de recherche max.
ja: 最大検索結果数
zh_cn: 最多搜索结果数

# Settings_CacheDurationMinutes.Text
source: Cache Duration (minutes)
de: Cache-Dauer (Minuten)
es: Duración de caché (minutos)
fr: Durée du cache (minutes)
ja: キャッシュ期間 (分)
zh_cn: 缓存时长(分钟)

# Settings_Storage.Text
source: Storage
de: Speicher
es: Almacenamiento
fr: Stockage
ja: ストレージ
zh_cn: 存储

# Settings_DataLocation.Text
source: Data Location
de: Datenspeicherort
es: Ubicación de datos
fr: Emplacement des données
ja: データの場所
zh_cn: 数据位置

# Settings_Encrypted.OnContent
source: Encrypted
de: Verschlüsselt
es: Cifrado
fr: Chiffré
ja: 暗号化済み
zh_cn: 已加密

# Settings_Encrypted.OffContent
source: Not encrypted
de: Nicht verschlüsselt
es: Sin cifrar
fr: Non chiffré
ja: 暗号化なし
zh_cn: 未加密

# Settings_Connections.Text
source: Connections
de: Verbindungen
es: Conexiones
fr: Connexions
ja: 接続
zh_cn: 连接

# Settings_EnableLocalApi.Header
source: Enable Local API
de: Lokale API aktivieren
es: Activar API local
fr: Activer l'API locale
ja: ローカル API を有効化
zh_cn: 启用本地 API

# Settings_EnableLocalApi.OffContent
source: Disabled
de: Deaktiviert
es: Desactivado
fr: Désactivé
ja: 無効
zh_cn: 已禁用

# Settings_EnableLocalApi.OnContent
source: Enabled (authenticated)
de: Aktiviert (authentifiziert)
es: Activado (autenticado)
fr: Activé (authentifié)
ja: 有効 (認証あり)
zh_cn: 已启用(需身份验证)

# Settings_ApiToken.Text
source: API Token
es: Token de API
fr: Jeton d'API
ja: API トークン
zh_cn: API 令牌

# Settings_NoTokenYetClickPh.PlaceholderText
source: No token yet. Click Regenerate.
de: Noch kein Token. Klicken Sie auf „Neu generieren“.
es: Aún no hay token. Haga clic en Regenerar.
ja: トークンがありません — [再生成] をクリック
zh_cn: 尚无令牌。请点击“重新生成”。

# Settings_RevealApiToken.Content
source: Show
de: Anzeigen
es: Mostrar
fr: Afficher
ja: 表示
zh_cn: 显示

source: Show API token
de: API-Token anzeigen
es: Mostrar token de API
fr: Afficher le jeton d'API
ja: API トークンを表示
zh_cn: 显示 API 令牌

# Settings_Copy.Content
source: Copy
de: Kopieren
es: Copiar
fr: Copier
ja: コピー
zh_cn: 复制

# Settings_Copy.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Copy API token
de: API-Token kopieren
es: Copiar token de API
fr: Copier le jeton d'API
ja: API トークンをコピー
zh_cn: 复制 API 令牌

# Settings_Regenerate.Content
source: Regenerate
de: Neu generieren
es: Regenerar
fr: Régénérer
ja: 再生成
zh_cn: 重新生成

# Settings_KeepThisTokenSecret.Text
source: Keep this token secret. Regenerating it revokes the old token at once, so paired clients stop working until you paste the new one. Turning the API on or off takes effect when you save settings.
de: Halten Sie dieses Token geheim. Beim Neugenerieren wird das alte Token sofort widerrufen, gekoppelte Clients funktionieren erst wieder, wenn Sie das neue Token einfügen. Das Ein- oder Ausschalten der API wird beim Speichern der Einstellungen wirksam.
es: Mantenga este token en secreto. Al regenerarlo, el token anterior se revoca de inmediato y los clientes vinculados dejan de funcionar hasta que pegue el nuevo. Activar o desactivar la API surte efecto al guardar la configuración.
fr: Gardez ce jeton secret. Le régénérer révoque immédiatement l'ancien jeton, et les clients associés cessent de fonctionner jusqu'à ce que vous colliez le nouveau. L'activation ou la désactivation de l'API prend effet lorsque vous enregistrez les paramètres.
ja: このトークンは秘密にしてください。再生成すると古いトークンは直ちに無効になり、新しいトークンを貼り付けるまでペアリング済みのクライアントは動作しません。API のオン/オフは設定を保存したときに反映されます。
zh_cn: 请妥善保管此令牌。重新生成后,旧令牌会立即失效,已配对的客户端在粘贴新令牌之前将无法使用。开启或关闭 API 会在保存设置后生效。

# Settings_SaveSettings.Content
source: Save Settings
de: Einstellungen speichern
es: Guardar configuración
fr: Enregistrer les paramètres
ja: 設定を保存
zh_cn: 保存设置
